# ValueParsingOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueParsingOptions Constructor
ValueParsingOptions Class See Also
---
Creates a new ValueParsingOptions object with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ValueParsingOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ValueParsingOptions()
```

# See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace